#### Terragrunt Plan 📖 (infra/demo/path2) `success`

<details><summary>Show Plan</summary>

```
12:06:31.082 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
12:06:31.082 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
12:06:31.082 STDOUT tofu:   + create
12:06:31.082 STDOUT tofu: OpenTofu will perform the following actions:
12:06:31.082 STDOUT tofu:   # google_storage_bucket.auto-expire will be created
12:06:31.082 STDOUT tofu:   + resource "google_storage_bucket" "auto-expire" {
12:06:31.082 STDOUT tofu:       + effective_labels            = {
12:06:31.082 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
12:06:31.082 STDOUT tofu:         }
12:06:31.082 STDOUT tofu:       + force_destroy               = true
12:06:31.082 STDOUT tofu:       + id                          = (known after apply)
12:06:31.083 STDOUT tofu:       + location                    = "US"
12:06:31.083 STDOUT tofu:       + name                        = "thr-no-public-access-bucket"
12:06:31.083 STDOUT tofu:       + project                     = "psyched-circuit-405312"
12:06:31.083 STDOUT tofu:       + project_number              = (known after apply)
12:06:31.083 STDOUT tofu:       + public_access_prevention    = "enforced"
12:06:31.083 STDOUT tofu:       + rpo                         = (known after apply)
12:06:31.083 STDOUT tofu:       + self_link                   = (known after apply)
12:06:31.083 STDOUT tofu:       + storage_class               = "STANDARD"
12:06:31.083 STDOUT tofu:       + terraform_labels            = {
12:06:31.083 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
12:06:31.083 STDOUT tofu:         }
12:06:31.083 STDOUT tofu:       + time_created                = (known after apply)
12:06:31.083 STDOUT tofu:       + uniform_bucket_level_access = (known after apply)
12:06:31.083 STDOUT tofu:       + updated                     = (known after apply)
12:06:31.083 STDOUT tofu:       + url                         = (known after apply)
12:06:31.083 STDOUT tofu:       + soft_delete_policy (known after apply)
12:06:31.083 STDOUT tofu:       + versioning (known after apply)
12:06:31.083 STDOUT tofu:       + website (known after apply)
12:06:31.083 STDOUT tofu:     }
12:06:31.083 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
12:06:31.083 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
12:06:31.084 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
12:06:31.084 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @muralisathenapally, Directory: `infra/demo/path2`*